
import numpy as np


subjects = ['CHAF','LEFC','FERJ','SEMC','VACJ','PIRJ']

###################################################
x0,y0,z0 = 20, 30,-16 #VOI for olf OFC
x1,y1,z1 = -20, 32,-16 #VOI for olf OFC
x0_ins,y0_ins,z0_ins = 42.0, -7.3, 0.3 #VOI for olf Ins
x1_ins,y1_ins,z1_ins = -38, -4, 12 #VOI for olf Ins
rad = 11 #radius of the VOI
HC_lim = -26 #limit anterior/posterior part of the aHC
###################################################

def rename_elecs(names,x,y,z):

    labels = ['pPirT' if lab =='Amg-PirT' else lab for lab in names]

    labels = ['aHC' if lab == 'HC' and y[i] > -26 else lab \
                                  for i,lab in enumerate(labels)]

    id_R_OFC = [1 if all([x0-rad<round(x[i])<x0+rad, y0-rad<round(y[i])<y0+rad,
                    z0-rad<round(z[i])<z0+rad]) else 0 for i in range(len(labels))]
    id_L_OFC = [1 if all([x1-rad<round(x[i])<x1+rad, y1-rad<round(y[i])<y1+rad,
                    z1-rad<round(z[i])<z1+rad]) else 0 for i in range(len(labels))]
    idx_OFC = np.array(id_R_OFC) + np.array(id_L_OFC)
    labels = ['OFC_olf' if idx == 1 else labels[i] for i,idx in enumerate(idx_OFC)]

    id_R_ins = [1 if all([x0_ins-rad<=round(x[i])<=x0_ins+rad, y0_ins-rad<=round(y[i])<=y0_ins+rad,
                    z0_ins-rad<=round(z[i])<=z0_ins+rad]) else 0 for i in range(len(labels))]
    id_L_ins = [1 if all([x1_ins-rad<=round(x[i])<=x1_ins+rad, y1_ins-rad<=round(y[i])<=y1_ins+rad,
                    z1_ins-rad<=round(z[i])<=z1_ins+rad]) else 0 for i in range(len(labels))]
    idx_ins = np.array(id_R_ins) + np.array(id_L_ins)
    labels = ['Ins_olf' if i == 1 else lab for i,lab in zip(idx_ins,labels)]

    return np.array(labels)

score_odor_su = {
                'CHAF': {'2': 0.667, '1': 3.667, '4': 4.667, '5': 7.333, '8': 19.333, '7': 30.667, '3': 44.667, '9': 58.667},
                'LEFC': {'2': 0.0, '1': 1.667, '16': 1.667, '15': 2.0, '3': 3.333, '4': 7.333, '17': 30.667, '14': 58.667},
                'FERJ': {'16': 2.333, '17': 2.333, '12': 3.333, '7': 3.667, '13': 4.333, '5': 4.667, '2': 5.0, '1': 5.333},
                'VACJ': {'11': 1.667, '14': 3.667, '12': 4.0, '10': 4.333, '17': 6.0, '16': 30.667, '13': 35.333, '15': 42.667},
                'SEMC': {'10': 1.0, '7': 3.333, '11': 4.0, '12': 4.0, '13': 4.333, '5': 4.667, '8': 5.667, '9': 7.333},
                'PIRJ': {'9': 0.667, '15': 1.333, '1': 1.667, '5': 1.667, '18': 10.667, '4': 12.667, '6': 16.667, '7': 26.667}
                }

su_list_od = {'CHAF' : ['1','2','4','5','3','8','7','9'],
                    'VACJ' : ['11','14','12','10','15','17','16','13'],
                    'SEMC' : ['7','10','11','12','13','5','8','9'],
                    'PIRJ' : ['1','9','5','4','6','7','18'],
                    'LEFC' : ['15','2','1','16','14','3','4','17'],
                    'FERJ' : ['7','12','16','17','13','1','5','2']}

su_odor_groups = {'CHAF' : {'low':['1','2','4','5'],
                              'high':['3','8','7','9']},
                    'VACJ' : {'low':['11','14','12','10'],
                              'high':['15','17','16','13']},
                    'SEMC' : {'low':['7','10','11','12','13'],
                              'high':['5','8','9']},
                    'PIRJ' : {'low':['1','9','5'],
                              'high':['4','6','7','18']},
                    'LEFC' : {'low':['15','2','1','16'],
                              'high':['14','3','4','17']},
                    'FERJ' : {'low':['7','2','16','17'],
                              'high':['12','1','5','13']},}

context_su = {'CHAF': {'M':['5','7','8','9'],'F':['1','2','3','4']},
              'LEFC': {'M':['1','2','3','4'],'F':['14','15','16','17']},
              'PIRJ': {'M':['4','9','1','18'],'F':['6','5','7']}, #missing odor 15
              'VACJ': {'M':['14','15','16','17'],'F':['10','11','12','13']},
              'SEMC': {'M':['10','11','12','13'],'F':['5','7','8','9']},
              'FERJ': {'M':['16','17','5','7'],'F':['12','13','2','1']},}

odor_groups_wgth = {'CHAF' : {'low':['1','2','4','5'],
                              'high':['3','8','7','9']},
                    'VACJ' : {'low':['11','14','12','10'],
                              'high':['15','17','16','13']},
                    'SEMC' : {'low':['7','10','11','12','13'],
                              'high':['5','8','9']},
                    'PIRJ' : {'low':['1','9','5'],
                              'high':['4','6','7','18']},
                    'LEFC' : {'low':['15','2','1','16'],
                              'high':['14','3','4','17']},
                    'FERJ' : {'low':['7','12','16','17'],
                              'high':['13','1','5','2']},}

odor_groups_3wgth = {'CHAF' : {'low':['1','2','4'],'mid':['5','8'],'high':['3','7','9']},
                   	'VACJ' : {'low':['10','11','14'],'mid':['12','17'],'high':['16','13','15']},
                   	'SEMC' : {'low':['10','7','13'],'mid':['11','12'],'high':['5','9','8']},
                   	'PIRJ' : {'low':['9','1','5'],'mid':['18','4'],'high':['6','7']},
                   	'LEFC' : {'low':['2','1','16'],'mid':['15','3'],'high':['4','17','14']},
                   	'FERJ' : {'low':['16','17','12'],'mid':['7','13'],'high':['5','2','1']},
                   }

odor_su_score = {
             'LEFC': {16: 1.67, 1: 1.67, 2: 0, 3:3.33, 4:7.33, 17:30.67, 14:58.67, 15:2},
             'SEMC': {5: 4.67, 7:3.33, 8: 5.67, 9: 7.33, 10: 1, 11:4, 12:4, 13: 4.33},
             'PIRJ': {1: 1.67, 18: 10.67, 4:12.67, 9:0.67,5:1.67, 6:16.67, 7:36.67, 15:9.33}, #5:
             'FERJ': {16:2.33, 1:3.33, 2:5, 17:2.33, 5:4.67, 7:3.67, 12: 3.33, 13:4.33, 1:5.33},
             'CHAF': {1:3.67, 2:0.67, 4: 4.67, 5: 7.33, 7: 30.67, 3:44.67,8:19.33, 9:58.67},
             'VACJ': {16: 30.67, 17: 6, 10: 4.33, 11:1.67, 12:4, 14:3.67, 13:35.33, 15:42.67}}


d_su_gr_fam_pl = {'CHAF': {'low_f': [8, 9, 3], 'high_f': [7, 2],
					'neu_pl': [8, 9], 'ext_pl': [7, 2, 3]},
				 'LEFC': {'low_f': [1, 3, 4, 14], 'high_f': [2, 15, 16, 17],
				 	'neu_pl': [1, 4, 16, 17], 'ext_pl': [2, 3, 14, 15]},
				 'PIRJ': {'low_f': [9, 1], 'high_f': [4, 18],
				 	'neu_pl': [4, 18,], 'ext_pl': [9, 1]},
				 'VACJ': {'low_f': [14, 10, 12, 13], 'high_f': [15, 16, 17, 11],
				 	'neu_pl': [16, 17, 10, 12], 'ext_pl': [14, 15, 11, 13]},
				 'SEMC': {'low_f': [10, 12, 13, 8], 'high_f': [11, 5, 7, 9],
				 	'neu_pl': [12, 5, 8, 9], 'ext_pl': [10, 11, 13, 7]},
				 'FERJ': {'low_f': [5, 12, 13, 1], 'high_f': [16, 17, 7, 2],
					'neu_pl': [16, 17, 5, 12], 'ext_pl': [7, 13, 2, 1]}}

def odor_list_su(exp):
	if exp == 'Enc':
		odlist_su = {'CHAF': [7,8,9,2,3], #4,5,1 missing wth Encoding
            'LEFC': [1,2,3,4,14,15,16,17],
            'PIRJ': [4,9,1,18], #missing odor 15,6,5,7
            'VACJ': [14,15,16,17,10,11,12,13],
            'SEMC': [10,11,12,13,5,7,8,9],
            'FERJ': [16,17,5,7,12,13,2,1]}


	if exp == 'Early_Late':
		odlist_su = {'CHAF': [7,8,9,2,3], #4,5,1 missing wth Encoding
            'LEFC': [1,2,3,4,14,15,16,17],
            'PIRJ': [4,9,1,18,6,7], #missing odor 15,6,5,7
            'VACJ': [14,15,16,17,10,11,12,13],
            'SEMC': [10,11,12,13,5,7,8,9],
            'FERJ': [16,17,5,7,12,13,2,1]}

	if exp == 'Ret':
		odlist_su = {'CHAF': [1,5,4,7,8,9,2,3], #4,5,1 missing wth Encoding
	        'LEFC': [1,2,3,4,14,15,16,17],
	        'PIRJ': [4,9,1,18,5,6,7], #missing odor 15,6,5,7
	        'VACJ': [14,15,16,17,10,11,12,13],
	        'SEMC': [10,11,12,13,5,7,8,9],
	        'FERJ': [16,17,5,7,12,13,2,1]}
	return odlist_su


odor_REC_RT_3wgth = {	'CHAF' : {'low':['2','5','9'],'mid':['4','8'],'high':['3','7','1']},
                    	'LEFC' : {'low':['2','3','17'],'mid':['4','16'],'high':['15','1','14']},
                    	'FERJ' : {'low':['16','17','2'],'mid':['12','13'],'high':['5','7','1']},
                    	'VACJ' : {'low':['12','11','17'],'mid':['14','10'],'high':['16','13','15']},
                    	'SEMC' : {'low':['10','11','5'],'mid':['8','12'],'high':['7','9','13']},
                    	'PIRJ' : {'low':['5','9'],'mid':['18','4'],'high':['1','6','7']},
                    }

odor_EPI_RT_3wgth = {	'CHAF' : {'low':['4','5','9'],'mid':['3','8'],'high':['2','7','1']},
                    	'LEFC' : {'low':['15','4','3'],'mid':['17','14'],'high':['16','1','2']},
                    	'FERJ' : {'low':['13','7','2'],'mid':['16','5'],'high':['12','17','1']},
                    	'VACJ' : {'low':['12','14','17'],'mid':['11','10'],'high':['16','13','15']},
                    	'SEMC' : {'low':['12','11','8'],'mid':['5','9'],'high':['7','10','13']},
                    	'PIRJ' : {'low':['6','5','4'],'mid':['18','9'],'high':['1','7']},
                    }

odor_REC_first_3wgth = {'CHAF' : {'low':['4','8','7'],'mid':['5','1'],'high':['3','9','2']},
                    	'LEFC' : {'low':['2','3','4'],'mid':['17','14'],'high':['16','15','1']},
                    	'FERJ' : {'low':['2','17','12'],'mid':['7','13'],'high':['16','5','1']},
                    	'VACJ' : {'low':['12','11','10'],'mid':['14','16'],'high':['17','13','15']},
                    	'SEMC' : {'low':['10','11','8'],'mid':['5','9'],'high':['7','12','13']},
                    	'PIRJ' : {'low':['5','9','18'],'mid':['6','1'],'high':['4','7']},
                    }

odor_EPI_first_3wgth = {'CHAF' : {'low':['4','5','8'],'mid':['7','1'],'high':['9','3','2']},
                    	'LEFC' : {'low':['2','15','4'],'mid':['17','3'],'high':['16','1','14']},
                    	'FERJ' : {'low':['13','7','2'],'mid':['1','5'],'high':['12','17','16']},
                    	'VACJ' : {'low':['12','14','17'],'mid':['11','10'],'high':['16','13','15']},
                    	'SEMC' : {'low':['5','11','8'],'mid':['12','7'],'high':['9','10','13']},
                    	'PIRJ' : {'low':['6','5','4'],'mid':['7','9'],'high':['1','18']},
                    }

pos_cirles = 	{'P1':[244,334],'P2':[162,597],
				 'P3':[755,519],'P4':[764,143],
				 'P5':[83,117],'P6':[395,158],
				 'P7':[401,640],'P8':[541,345],}

pos_up_down = 	{'P1':'mid','P2':'down',
				 'P3':'down','P4':'up',
				 'P5':'up','P6':'up',
				 'P7':'down','P8':'mid',}

pos_RL = 	{'P1':'left','P2':'left',
			 'P3':'right','P4':'right',
			 'P5':'left','P6':'mid',
			 'P7':'mid','P8':'right',}


pos_dist_gr = {'P1': {'close': ['P2', 'P5', 'P6'],
					'far': ['P4', 'P3', 'P7', 'P8']},
				'P2': {'close': ['P5', 'P8', 'P7'],
					'far': ['P1', 'P4', 'P3', 'P6']},
				'P3': {'close': ['P4', 'P7', 'P8'],
					'far': ['P2', 'P1', 'P5', 'P6']},
				'P4': {'close': ['P7', 'P6', 'P8'],
					'far': ['P2', 'P1', 'P3', 'P5']},
				'P5': {'close': ['P7', 'P8', 'P6'],
					'far': ['P3', 'P4', 'P2', 'P1']},
				'P6': {'close': ['P1', 'P7', 'P8'],
					'far': ['P3', 'P2', 'P4', 'P5']},
				'P7': {'close': ['P1', 'P2', 'P8'],
					'far': ['P4', 'P5', 'P6', 'P3']},
				f'P8': {'close': ['P1', 'P3', 'P6'],
					'far': ['P5', 'P2', 'P7', 'P4']}}

odor_exp = ["Musc","Rosemarel","Stémone","2-Héptanone","Carotte",
			"Butanol","Dihydromyrcénol","Salicylate_cis_3_hexanyl",
			"Octine_carbonate_de_méthyl","Citronellol","Birch_oil",
			"Acétate_linalyle","9_decen-1-ol","Tabac","Acétyl_acetate_d_éthyl",
			"Basilic_comores","Tomate","Oxyde de rose","Pamplemousse","Ebanol"]
